app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls"
---
  def index
    @url = Url.new
    @urls = Url.all

INSERT INTO "urls" ("long_url", "short_partial_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "url_ips" ("ip_address", "url_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @url = Url.new(url_params)
    @url.short_partial_url = SecureRandom.hex(3)
    @url.save
    @url_ip = UrlIp.create(ip_address: request.remote_ip, url_id: @url.id)

SELECT  "urls".* FROM "urls" WHERE "urls"."short_partial_url" = ? LIMIT 1
UPDATE "urls" SET "clicks" = ?, "updated_at" = ? WHERE "urls"."id" = ?
---
  def show
    @short_partial_url = request.original_fullpath[1..-1]
    @url = Url.find_by(short_partial_url: @short_partial_url)
    @url.clicks += 1
    @url.save